; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v5)
             (pred_6 ?v4 ?v6)
             (pred_9 ?v9 ?v6)
             (pred_12 ?v1 ?v9 )
	     (pred_7 ?v9)
             (pred_11 ?v2)
             (pred_4 ?v4)
             (pred_8 ?v6)
             (pred_2 ?v9)
             (pred_5 ?v4)
             (pred_1 ?v9)
             (pred_3 ))



(:action op_2
:parameters (?v7 ?v11 ?v3 ?v10)
:precondition (and (pred_11 ?v7) (pred_11 ?v11) (pred_4 ?v3) (pred_8 ?v10)
          (pred_10 ?v7 ?v11) (pred_6 ?v3 ?v10)
                   (pred_9 ?v11 ?v10) (pred_7 ?v7) 
                   (pred_2 ?v11) (pred_5 ?v3))
:effect (and  (pred_1 ?v11) (not (pred_2 ?v11))))


(:action op_5
:parameters (?v7 ?v12)
:precondition (and (pred_11 ?v7) (pred_11 ?v12)
               (pred_7 ?v7) (pred_10 ?v7 ?v12) (pred_1 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v7))))

(:action op_4
:parameters (?v7 ?v3)
:precondition (and (pred_11 ?v7) (pred_4 ?v3) 
                  (pred_7 ?v7) (pred_12 ?v3 ?v7) (pred_3 ))
:effect (and (pred_5 ?v3)
   (not (pred_12 ?v3 ?v7)) (not (pred_3 ))))


(:action op_3
:parameters (?v7 ?v13 ?v8)
:precondition (and (pred_11 ?v7) (pred_4 ?v13) (pred_4 ?v8)
                  (pred_7 ?v7) (pred_5 ?v8) (pred_12 ?v13 ?v7))
:effect (and (pred_5 ?v13) (pred_12 ?v8 ?v7)
        (not (pred_5 ?v8)) (not (pred_12 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v3)
:precondition (and (pred_11 ?v7) (pred_4 ?v3) 
                  (pred_7 ?v7) (pred_5 ?v3))
:effect (and (pred_3 ) (pred_12 ?v3 ?v7) (not (pred_5 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_10 obj_11 obj_15 obj_04 obj_09 obj_13 obj_16 obj_18 obj_08 obj_20 obj_12 obj_07 obj_03 obj_19 obj_17
    obj_02 obj_06
    obj_14 obj_05
    )

    (:init
       (pred_3)

       (pred_11 obj_01)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_16)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_11 obj_20)
       (pred_11 obj_12)
       (pred_11 obj_07)
       (pred_11 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_05)

       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_04 obj_18)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_04)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_19)
       (pred_2 obj_17)
       (pred_2 obj_19)
       (pred_9  obj_17 obj_02)
       (pred_9  obj_19 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_10)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_07)
       (pred_1 obj_03)

       (pred_6  obj_14 obj_02)
       (pred_6  obj_05 obj_06)
       (pred_12 obj_14 obj_10)
       (pred_12 obj_05 obj_12)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_12 obj_14 obj_15)
    ))
(:constraints
  (always (not (pred_7 obj_11)))
)
)

; plan
1. (op_5 obj_13 obj_09)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_09)
   goals met: 0 of 1
2. (op_5 obj_09 obj_10)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_10)
   goals met: 0 of 1
3. (op_4 obj_10 obj_14)
   deleted: (pred_12 obj_14 obj_10) (pred_3)
   added: (pred_5 obj_14)
   goals met: 0 of 1
4. (op_5 obj_10 obj_09)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_09)
   goals met: 0 of 1
5. (op_5 obj_09 obj_13)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_13)
   goals met: 0 of 1
6. (op_5 obj_13 obj_16)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_16)
   goals met: 0 of 1
7. (op_5 obj_16 obj_15)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_15)
   goals met: 0 of 1
8. (op_1 obj_15 obj_14)
   deleted: (pred_5 obj_14)
   added: (pred_3) (pred_12 obj_14 obj_15)
   goals met: 1 of 1
